InformationRegisters/СинхронизацияДанныхИСМП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СинхронизацияДанныхИСМП</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаСинхронизации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТоварнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТоварныеГруппыГИСМТ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьВидПродукции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПродукцииИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийИСМП</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СинхронизацияДанныхИСМП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает дату выполнения синхронизациии в регистр в привелегированном режиме
//
// Параметры:
//  Организация       - ОпределяемыйТип.Организация.
//  ТоварнаяГруппа    - СправочникСсылка.ТоварныеГруппыГИСМТ.
//  Операция          - ПеречислениеСсылка.ВидыОперацийИСМП.
//  ДатаСинхронизации - Дата.
//  ПроверятьРегистр  - Булево.
//
Процедура УстановитьДатуВыполненияСинхронизации(Организация, ТоварнаяГруппа, Операция,
	ДатаСинхронизации = Неопределено, ПроверятьРегистр = Ложь) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Организация.Установить(Организация);
	НаборЗаписей.Отбор.ТоварнаяГруппа.Установить(ТоварнаяГруппа);
	НаборЗаписей.Отбор.Операция.Установить(Операция);
	
	Если ДатаСинхронизации <> Неопределено Тогда
		
		Если ПроверятьРегистр Тогда
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Выбран()
				И НаборЗаписей.Количество() > 0 Тогда
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		ЗаписьНабора = НаборЗаписей.Добавить();
		ЗаписьНабора.Организация        = Организация;
		ЗаписьНабора.ТоварнаяГруппа     = ТоварнаяГруппа;
		ЗаписьНабора.Операция           = Операция;
		ЗаписьНабора.ДатаСинхронизации  = ДатаСинхронизации;
		ЗаписьНабора.ДатаОбмена         = ТекущаяУниверсальнаяДата();
		
		НаборЗаписей.Записать();
		
	Иначе
		
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Выбран()
			И НаборЗаписей.Количество() > 0 Тогда
			
			Для Каждого ЗаписьНабора Из НаборЗаписей Цикл
				ЗаписьНабора.ДатаОбмена = ТекущаяУниверсальнаяДата();
			КонецЦикла;
			
			НаборЗаписей.Записать();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

// Возвращает данные о датах выгрузки, на которые были получены сведения об отклонениях.
// 
// Параметры:
//  Организация - ОпределяемыйТип.Организация.
//  Операция    - ПеречислениеСсылка.ВидыОперацийИСМП
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
// * Ключ - СправочникСсылка.ТоварныеГруппыГИСМТ.
// * Значение - Дата.
Функция ДатыСинхронизации(Организация, Операция) Экспорт
	
	ДатыСинхронизации = Новый Соответствие;
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	СинхронизацияДанныхИСМП.ДатаСинхронизации КАК ДатаСинхронизации,
	|	СинхронизацияДанныхИСМП.ТоварнаяГруппа    КАК ТоварнаяГруппа
	|ИЗ
	|	РегистрСведений.СинхронизацияДанныхИСМП КАК СинхронизацияДанныхИСМП
	|ГДЕ
	|	СинхронизацияДанныхИСМП.Организация = &Организация
	|	И СинхронизацияДанныхИСМП.Операция = &Операция";
	
	Запрос.УстановитьПараметр("Организация",  Организация);
	Запрос.УстановитьПараметр("Операция",     Операция);
	
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДатыСинхронизации.Вставить(Выборка.ТоварнаяГруппа, Выборка.ДатаСинхронизации);
		КонецЦикла;
	КонецЕсли;
	
	Возврат ДатыСинхронизации;
	
КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Списки) Экспорт

	УправлениеДоступомИСПереопределяемый.ПриЗаполненииОграниченияДоступа(
		Метаданные.РегистрыСведений.СинхронизацияДанныхИСМП, Списки);

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

Процедура ПриОпределенииКомандПодключенныхКОбъекту(Команды) Экспорт
	Возврат;
КонецПроцедуры

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
//
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт
	
	ОбновлениеИнформационнойБазыГосИС.ДобавитьОбработчикОбновленияПереходаНаКонструкторНастроек(
		Обработчики,
		Метаданные.РегистрыСведений.СинхронизацияДанныхИСМП,
		Новый УникальныйИдентификатор("49313597-5027-46fe-aeb4-4fcbd0b56165"));
	
КонецПроцедуры

// Регистрирует данные для обработчика обновления перехода на конструктор настроек
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.СинхронизацияДанныхИСМП;
	ОбновлениеИнформационнойБазыИСМП.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистрСведений(
		ОбъектМетаданных, Параметры, "ТоварнаяГруппа");
	
КонецПроцедуры

// Обработка данных перехода на конструктор настроек видов продукции
// 
// Параметры:
//  Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ОбъектМетаданных = Метаданные.РегистрыСведений.СинхронизацияДанныхИСМП;
	ОбновлениеИнформационнойБазыИСМП.ОбработатьДанныеДляПереходаНаНовуюВерсиюКонструктораНастроекРегистраСведений(
		ОбъектМетаданных, Параметры, "ТоварнаяГруппа");
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти

#КонецЕсли
